app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    @comments = Comment.all

INSERT INTO "comments" ("created_at", "idea_id", "reviewcomment", "reviewer", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-06-29 15:40:20.734138"], ["idea_id", 1], ["reviewcomment", "bbb"], ["reviewer", "aa"], ["updated_at", "2014-06-29 15:40:20.734138"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
  def destroy
    @comment.destroy

SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_comment
      @comment = Comment.find(params[:id])