app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT "ideas".* FROM "ideas"

  def show
    @comments = @idea.comments.all
---
SELECT "comments".* FROM "comments"  WHERE "comments"."idea_id" = ?  [["idea_id", 1]]

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("created_at", "description", "name", "place", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-06-27 12:54:42.774582"], ["description", "bbb"], ["name", "aaa"], ["place", "c"], ["updated_at", "2014-06-27 12:54:42.774582"]]

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "description" = ?, "updated_at" = ? WHERE "ideas"."id" = 1  [["description", "ggg"], ["updated_at", "2014-06-28 14:08:03.499173"]]

  def destroy
    @idea.destroy
---
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 3]]

    def set_idea
      @idea = Idea.find(params[:id])
---
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = ? LIMIT 1  [["id", 3]]